{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 48, 173, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 8, "kernel_size": [5, 5], "strides": [2, 3], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 256, "kernel_size": [5, 5], "strides": [1, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "primarycap_conv2d", "class_name": "Conv2D", "config": {"name": "primarycap_conv2d", "trainable": true, "filters": 256, "kernel_size": [9, 9], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "primarycap_reshape", "class_name": "Reshape", "config": {"name": "primarycap_reshape", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["primarycap_conv2d", 0, 0, {}]]]}, {"name": "primarycap_squash", "class_name": "Lambda", "config": {"name": "primarycap_squash", "trainable": true, "function": ["4wIAAAAAAAAABAAAAAUAAABDAAAAczwAAAB0AGoBdABqAnwAgwF8AWQBZAKNA30CfAJkA3wCFwAb\nAHQAagN8AnQAagSDABcAgwEbAH0DfAN8ABQAUwApBOEUAQAACiAgICBUaGUgbm9uLWxpbmVhciBh\nY3RpdmF0aW9uIHVzZWQgaW4gQ2Fwc3VsZS4gSXQgZHJpdmVzIHRoZSBsZW5ndGggb2YgYSBsYXJn\nZSB2ZWN0b3IgdG8gbmVhciAxIGFuZCBzbWFsbCB2ZWN0b3IgdG8gMAogICAgOnBhcmFtIHZlY3Rv\ncnM6IHNvbWUgdmVjdG9ycyB0byBiZSBzcXVhc2hlZCwgTi1kaW0gdGVuc29yCiAgICA6cGFyYW0g\nYXhpczogdGhlIGF4aXMgdG8gc3F1YXNoCiAgICA6cmV0dXJuOiBhIFRlbnNvciB3aXRoIHNhbWUg\nc2hhcGUgYXMgaW5wdXQgdmVjdG9ycwogICAgVCkB2ghrZWVwZGltc+kBAAAAKQXaAUvaA3N1bdoG\nc3F1YXJl2gRzcXJ02gdlcHNpbG9uKQTaB3ZlY3RvcnPaBGF4aXNaDnNfc3F1YXJlZF9ub3Jt2gVz\nY2FsZakAcgwAAAD1VAAAAGM6XFVzZXJzXGppbmh5XE9uZURyaXZlXOuwlO2DlSDtmZTrqbRcRGF0\nYXNldFxwcmVwcm9jZXNzaW5nXENhcHNOZXRcY2Fwc3VsZWxheWVycy5wedoGc3F1YXNoSwAAAHMG\nAAAAAAcWAR4B\n", [-1], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["primarycap_reshape", 0, 0, {}]]]}, {"name": "class_caps", "class_name": "CapsuleLayer", "config": {"name": "class_caps", "trainable": true, "num_capsule": 6, "dim_capsule": 16, "routings": 3}, "inbound_nodes": [[["primarycap_squash", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "mask_1", "class_name": "Mask", "config": {"name": "mask_1", "trainable": true}, "inbound_nodes": [[["class_caps", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "capsnet", "class_name": "Distance", "config": {"name": "capsnet", "trainable": true}, "inbound_nodes": [[["class_caps", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Sequential", "config": {"name": "decoder", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 96], "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 8304, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "out_recon", "trainable": true, "target_shape": [48, 173, 1]}}]}, "inbound_nodes": [[["mask_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["capsnet", 0, 0], ["decoder", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}